microporefilling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-19 Tue 00:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67bac2d">1. Micropore Filling</a></li>
<li><a href="#org20bdbd2">2. Potential Theory</a></li>
<li><a href="#org11775ed">3. Dubinin-Astakhov Model</a></li>
<li><a href="#orgcc79c5e">4. Dubinin-Radushkevich Model</a>
<ul>
<li><a href="#org0ecba08">4.1. The Characteristic Curve</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org67bac2d" class="outline-2">
<h2 id="org67bac2d"><span class="section-number-2">1</span> Micropore Filling</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>for pores with radii less than 15 A, adsorption follows micro-pore filling rather than surface coverage <a class='org-ref-reference' href="#Bering1966">Bering1966</a></li>
<li>in pores greater than 15 A, adsorption initially starts as surface coverage mechanism, but later turns into pore filling by capillary condensation mechanism once a threshold relative pressure is reached <a class='org-ref-reference' href="#Bering1966">Bering1966</a></li>
<li>adsorption in micropores is a limiting case of the capillary condensation theory <a class='org-ref-reference' href="#Bering1966">Bering1966</a></li>
</ul>
</div>
</div>


<div id="outline-container-org20bdbd2" class="outline-2">
<h2 id="org20bdbd2"><span class="section-number-2">2</span> Potential Theory</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>the potential theory was proposed for the characterization of sub-critical adsorption in micro-porous substances <a class='org-ref-reference' href="#Dubinin1960">Dubinin1960</a></li>
<li><a class='org-ref-reference' href="#Dubinin1960">Dubinin1960</a> found the ratio of limiting adsorption to micropore volume to be constant for many microporous substances (&lt;0.7 nm) at different temperatures, but could not find a correlation between surface area and adsorption for these substances, thus proposing the potential theory of adsorption.</li>
<li>the Potential model does not have the correct Henry's law behaviour at low pressures <a class='org-ref-reference' href="#Do1998">Do1998</a></li>
<li><a class='org-ref-reference' href="#Clarkson1997">Clarkson1997</a>  showed that micropore filling was the primary adsorption mechanism in shales.</li>
<li>temperature invariance is not a requirement for potential theory but rather just a co-incidence for many substances <a class='org-ref-reference' href="#Do1998">Do1998</a>
<ul class="org-ul">
<li>temperature invariance holds as long as adsorption forces are temperature-independent dispersion forces <a class='org-ref-reference' href="#Clarkson1997">Clarkson1997</a></li>
</ul></li>
<li>adsorption potential is given by <a class='org-ref-reference' href="#Dubinin1960">Dubinin1960</a>
<ul class="org-ul">
<li>\(A = R T ln (P/P_0)\)</li>
</ul></li>
<li><a class='org-ref-reference' href="#Dubinin1960">Dubinin1960</a> found that a plot of surface coverage, \(\theta = W/W_0\), against adsorption potential, A, is temperature invariant.</li>
<li>micro-pore volume is often positively correlated with TOC content of shales suggesting that micropores are more prevalent in organic pores <a class='org-ref-reference' href="#Wang2016">Wang2016</a></li>
<li>micropore filling occurs due to the adsorption force field encompassing the entire volume of micropores, leading to a significantly higher heat of adsorption compared to flat surfaces <a class='org-ref-reference' href="#Do1998">Do1998</a></li>
<li>a theoretical monolayer amount calculated from a Langmuir model is 2-3 times larger than the maximum associated with micropore filling <a class='org-ref-reference' href="#Do1998">Do1998</a></li>
<li>test to see if micropore filling is the prevailing adsorption mechanism <a class='org-ref-reference' href="#Clarkson2000">Clarkson2000</a>
<ul class="org-ul">
<li>\(\frac{C_{\mu 1}}{C_{\mu 2 }} ~ \frac{V_{v 1}}{V_{v 2}} \neq \frac{SSA_1}{SSA_2}\)</li>
</ul></li>
<li>another way of finding out if micropore filling is the dominant adsorption mechanism is to find out if a correlation could be obtained between Langmuir volumes (max adsorbed) and micropore volumes from the D-R equation.</li>
</ul>
</div>
</div>

<div id="outline-container-org11775ed" class="outline-2">
<h2 id="org11775ed"><span class="section-number-2">3</span> Dubinin-Astakhov Model</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>\[W = W_0 exp [-(\frac{R T}{\beta E} {ln \frac {P_0}{P}})^n]\] 
<ul class="org-ul">
<li>where,</li>
<li>w is amount adsorbed</li>
<li>\(w_0\) is the micropore volume</li>
<li>\(\beta\) is the affinity constant</li>
<li>E is the characteristic energy</li>
<li>n is a fitting constant</li>
</ul></li>
<li>The linear form of the equation is given as: 
<ul class="org-ul">
<li>\[ log(W) = log(W_0) - D(log(\frac{P_0}{P}))^n\] 
<ul class="org-ul">
<li>where w is the amount adsorbed,</li>
<li>w0 is the micropore volume</li>
<li>P0 is the saturation pressure</li>
<li>n is the Astakhov exponent</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcc79c5e" class="outline-2">
<h2 id="orgcc79c5e"><span class="section-number-2">4</span> Dubinin-Radushkevich Model</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>initially proposed by <a class='org-ref-reference' href="#Dubinin1960">Dubinin1960</a> for subcritical vapours in microporous solids</li>
<li>the DR model is a special case of the DA model where n=2, thereby reducing the number of fitting parameters</li>
<li>\[W = W_0 exp [-(\frac{R T}{\beta E} {ln \frac {P_0}{P}})^2]\]</li>
<li>where, 
<ul class="org-ul">
<li>w is amount adsorbed</li>
<li>\(w_0\) is the micropore volume</li>
<li>\(\beta\) is the affinity constant</li>
<li>E is the characteristic energy</li>
</ul></li>
<li>in terms of number of moles: 
<ul class="org-ul">
<li>\(C_{\mu}=C_{\mu s}exp[-\frac{1}{(\beta E_0)^2}(RTln(\frac{P}{P_0}))^2]\)</li>
<li>where,</li>
<li>E0 is the solid characteristic energy towards a reference adsorbate - Benzene is widely used as a reference adsorbate.</li>
<li>\(\beta\) is a constant which is a function of the adsorptive only.</li>
<li>Maximum adsorption capacity is the ratio of the micropore volume to the liquid molar volume: \(C_{\mu s} = \frac{W_0}{v_m (T)}\)</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org0ecba08" class="outline-3">
<h3 id="org0ecba08"><span class="section-number-3">4.1</span> The Characteristic Curve</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>a plot of the logarithm of the amount adsorbed against the square of adsorption potential</li>
<li>the slope of the characteristic curve is inverse of the square of the characteristic energy, \(E=\beta*E_0\), \(\sqrt(E)\)</li>
<li>characteristic curve, and the characteristic energy, does not change with temperature, this is not one of the assumptions of the potential theory, but merely an phenomenon that is observed to be true for many microporous carbon based adsorbents <a class='org-ref-reference' href="#Do1998">Do1998</a></li>
<li>the isosteric heat of adsorption of the DR equation can be derived from the van't Hoff's equation
<ul class="org-ul">
<li>\(-\Delta H = \Delta H_{vap} + \beta E_0(ln(\frac{1}{\theta}))^{(1/2)} + \frac{(\beta E_0)\delta T}{2}(ln(\frac{1}{\theta}))^{(-1/2)}\)</li>
<li>where,</li>
<li>\(\Delta H_{vap}\) is the latent heat of vaporisation.</li>
<li>\(\delta\) is the change in saturation capacity with respect to temperature: \(\frac{1}{C_{\mu s}} \frac{dC_{\mu s}}{dT}=-\delta\)</li>
</ul></li>
<li>the net heat of adsorption is the isosteric heat minus the heat of vaporization: 
<ul class="org-ul">
<li>\(-\Delta H = \beta E_0(ln(\frac{1}{\theta}))^{(1/2)} + \frac{(\beta E_0)\delta T}{2}(ln(\frac{1}{\theta}))^{(-1/2)}\)</li>
</ul></li>
<li>heat of adsorption may be calculated as <a class='org-ref-reference' href="#Clarkson2000">Clarkson2000</a>:
<ul class="org-ul">
<li>\(Q=\Delta H_{vap} + \beta E\)</li>
</ul></li>
<li>the enthalpy of immersion is the amount of heat released if the adsorption takes place in a bulk liquid adsorbate.
<ul class="org-ul">
<li>as adsorbate density is assumed to be equal to liquid density in absence of more accurate data, there is no phase change associated with this metric - enthalpy of immersion.</li>
<li>heat of immersion is calculated from the net heat of adsorption:</li>
<li>\(\Delta h_i = \int_0^1 q_{net} (\theta) d\theta = -(\beta E_0)(1+\delta T) \Gamma(\frac{3}{2})\)</li>
<li>from experiments that determine the heat of immersion for different systems, the characteristic energy can be calculated <a class='org-ref-reference' href="#Do1998">Do1998</a></li>
</ul></li>
<li>the DR model often provides a better fit for shale adsorption, despite having the same number of parameters as Lanmmuir <a class='org-ref-reference' href="#Clarkson1997">Clarkson1997</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-06-19 Tue 00:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
